package com.dugaza.letsdrive.util

fun generateRandomNickname(): String {
    val adjectives =
        listOf(
            "행복한", "즐거운", "기쁜", "밝은", "빛나는",
            "환한", "상쾌한", "유쾌한", "활기찬", "힘찬",
            "긍정적인", "낙관적인", "용감한", "따뜻한",
            "자유로운", "평온한", "편안한", "사랑스러운",
            "감사하는", "든든한", "정직한", "친절한",
            "기운찬", "부드러운", "다정한", "소중한",
            "신나는", "자랑스러운", "멋진", "훌륭한",
            "대단한", "활발한", "성실한", "아름다운",
            "총명한", "똑똑한", "기발한", "창의적인",
            "영리한", "용의주도한", "우아한", "예쁜",
            "매력적인", "화려한", "강인한", "날렵한",
            "용맹한", "끈기있는", "참신한", "센스있는",
            "배려하는", "따뜻한", "사려깊은", "정다운",
            "믿음직한", "현명한", "차분한", "온화한",
            "희망찬", "신비로운", "풍요로운", "넉넉한",
            "건강한", "행운의", "빛바랜", "명랑한",
            "찬란한", "눈부신", "감동적인",
            "평화로운", "매끄러운", "고요한", "경쾌한",
            "사뿐한", "부드러운", "다채로운", "화사한",
            "유명한", "번뜩이는", "알찬", "섬세한", "신중한",
            "중요한", "독창적인", "탁월한", "정확한",
            "열정적인", "끈질긴", "고귀한", "지혜로운",
            "깨끗한", "단아한", "기품있는", "정돈된",
            "감미로운", "스피드한", "순수한", "기적의", "꿈같은",
            "흥미로운", "빠른", "향기로운",
        )
    val nouns =
        listOf(
            "사자", "호랑이", "늑대", "여우", "곰",
            "코끼리", "기린", "토끼", "다람쥐", "판다",
            "강아지", "고양이", "햄스터", "수달", "부엉이",
            "올빼미", "매", "독수리", "백곰", "사슴",
            "두루미", "거북이", "펭귄", "알파카", "코알라",
            "치타", "스컹크", "너구리", "고슴도치",
            "침팬지", "원숭이", "카멜레온", "퓨마", "표범",
            "재규어", "하이에나", "비버", "두더지", "청설모",
            "까마귀", "앵무새", "백조", "기러기", "오리",
            "독도새", "갈매기", "까치", "거위", "도마뱀",
            "악어", "이구아나", "살모사", "코브라", "낙타",
            "하마", "두꺼비", "개구리", "달팽이", "장수풍뎅이",
            "사슴벌레", "나비", "잠자리", "무당벌레", "개미",
            "꿀벌", "말벌", "반딧불이", "거미", "해마",
            "문어", "오징어", "가재", "게", "바다표범", "바다코끼리", "고라니",
        )

    return "${adjectives.random()}${nouns.random()}"
}
